<?php
//задание 1 
$a = 0;
while ($a < 100) {
    $a++;
    if ($a % 3 == 0) {
        echo $a . " ";
    }
}
echo "<br>" . "<br>";

//задание 2
$b = 0;
do {
    if ($b == 0) {
        echo $b . " - ноль.";
    } elseif ($b % 2 == 0) {
        echo $b . " - четное число.";
    } else {
        echo $b . " - нечетное число.";
    }
    $b++;
    echo "<br>";
} while ($b <= 10);
echo "<br>" . "<br>";

//задание 3 
$region = [
    "Московская облласть" => [
        "Москва", "Зеленоград", "Клин"
    ],
    "Ленинградская облласть" => [
        "Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"
    ],
    "Рязанская область" => [
        "Рязань", "Касимов", "Шацк"
    ]
];
foreach ($region as $key => $town) {
    echo "<strong>" . $key . ":" . "</strong>" . "<br>";
    $c = implode(", ", $town);
    echo $c;
    echo "<br>";
};
echo "<br>" . "<br>";


//задание 4

function translit($string)
{
    $converter = array(
        'а' => 'a',   'б' => 'b',   'в' => 'v',
        'г' => 'g',   'д' => 'd',   'е' => 'e',
        'ё' => 'e',   'ж' => 'zh',  'з' => 'z',
        'и' => 'i',   'й' => 'y',   'к' => 'k',
        'л' => 'l',   'м' => 'm',   'н' => 'n',
        'о' => 'o',   'п' => 'p',   'р' => 'r',
        'с' => 's',   'т' => 't',   'у' => 'u',
        'ф' => 'f',   'х' => 'h',   'ц' => 'c',
        'ч' => 'ch',  'ш' => 'sh',  'щ' => 'sch',
        'ь' => '\'',  'ы' => 'y',   'ъ' => '\'',
        'э' => 'e',   'ю' => 'yu',  'я' => 'ya',

        'А' => 'A',   'Б' => 'B',   'В' => 'V',
        'Г' => 'G',   'Д' => 'D',   'Е' => 'E',
        'Ё' => 'E',   'Ж' => 'Zh',  'З' => 'Z',
        'И' => 'I',   'Й' => 'Y',   'К' => 'K',
        'Л' => 'L',   'М' => 'M',   'Н' => 'N',
        'О' => 'O',   'П' => 'P',   'Р' => 'R',
        'С' => 'S',   'Т' => 'T',   'У' => 'U',
        'Ф' => 'F',   'Х' => 'H',   'Ц' => 'C',
        'Ч' => 'Ch',  'Ш' => 'Sh',  'Щ' => 'Sch',
        'Ь' => '\'',  'Ы' => 'Y',   'Ъ' => '\'',
        'Э' => 'E',   'Ю' => 'Yu',  'Я' => 'Ya',
    );
    return strtr($string, $converter);
}
$str = "это задание  нечайно спер и разобрался, но замену пробела сделал сам!";
$str = translit($str);
echo $str . "<br>";

// задание 5 
function spaceReplacement($replace)
{
    $searchSymbol = '/\s/';
    $replace = preg_replace($searchSymbol, '_', $replace);
    return $replace;
}
echo spaceReplacement($str);
